#+title: Schools in Singapore

Simple app to search for schools in Singapore. Demonstrate using Python, Django,
React and ElasticSearch

* Requirement

- Python 3.6, pipenv
- NodeJS
- Docker

* Run each of these in one terminal tab

#+BEGIN_SRC sh
  docker-compose up
#+END_SRC

#+BEGIN_SRC sh
  npm install
  npm start
#+END_SRC

#+BEGIN_SRC sh
  pipenv install
  pipenv run ./manage.py migrate
  pipenv run ./manage.py createsuperuser
  pipenv run ./manage.py import general-information-of-schools.csv
  pipenv run ./manage.py search_index --create
  pipenv run ./manage.py search_index --populate
  pipenv run ./manage.py runserver
#+END_SRC

* API

#+begin_src http :pretty
  GET http://localhost:8000/api/v1/schools?q=Nanyang
#+end_src

#+RESULTS:
#+begin_example
HTTP/1.1 500 Internal Server Error
Date: Mon, 14 Oct 2019 08:04:04 GMT
Server: WSGIServer/0.2 CPython/3.7.4
Content-Type: text/plain; charset=utf-8
X-Frame-Options: SAMEORIGIN
Content-Length: 15868
Vary: Cookie

AttributeError at /api/v1/schools
type object 'School' has no attribute 'field_names'

Request Method: GET
Request URL: http://localhost:8000/api/v1/schools?q=Nanyang
Django Version: 2.2.6
Python Executable: /Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/bin/python
Python Version: 3.7.4
Python Path: ['/Users/tung/Projects/insight/schools-in-singapore', '/opt/pkg/lib/python37.zip', '/opt/pkg/lib/python3.7', '/opt/pkg/lib/python3.7/lib-dynload', '/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages']
Server time: Mon, 14 Oct 2019 08:04:04 +0000
Installed Applications:
['django.contrib.admin',
 'django.contrib.auth',
 'django.contrib.contenttypes',
 'django.contrib.sessions',
 'django.contrib.messages',
 'django.contrib.staticfiles',
 'django_elasticsearch_dsl',
 'schools']
Installed Middleware:
['django.middleware.security.SecurityMiddleware',
 'django.contrib.sessions.middleware.SessionMiddleware',
 'django.middleware.common.CommonMiddleware',
 'django.middleware.csrf.CsrfViewMiddleware',
 'django.contrib.auth.middleware.AuthenticationMiddleware',
 'django.contrib.messages.middleware.MessageMiddleware',
 'django.middleware.clickjacking.XFrameOptionsMiddleware']


Traceback:

File "/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages/django/core/handlers/exception.py" in inner
  34.             response = get_response(request)

File "/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages/django/core/handlers/base.py" in _get_response
  115.                 response = self.process_exception_by_middleware(e, request)

File "/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages/django/core/handlers/base.py" in _get_response
  113.                 response = wrapped_callback(request, *callback_args, **callback_kwargs)

File "/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages/django/views/decorators/csrf.py" in wrapped_view
  54.         return view_func(*args, **kwargs)

File "/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages/django/views/generic/base.py" in view
  71.             return self.dispatch(request, *args, **kwargs)

File "/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages/rest_framework/views.py" in dispatch
  505.             response = self.handle_exception(exc)

File "/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages/rest_framework/views.py" in handle_exception
  465.             self.raise_uncaught_exception(exc)

File "/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages/rest_framework/views.py" in raise_uncaught_exception
  476.         raise exc

File "/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages/rest_framework/views.py" in dispatch
  502.             response = handler(request, *args, **kwargs)

File "/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages/rest_framework/generics.py" in get
  199.         return self.list(request, *args, **kwargs)

File "/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/lib/python3.7/site-packages/rest_framework/mixins.py" in list
  38.         queryset = self.filter_queryset(self.get_queryset())

File "/Users/tung/Projects/insight/schools-in-singapore/schools/views.py" in get_queryset
  52.             fields = list(models.School.field_names - filters.keys())

Exception Type: AttributeError at /api/v1/schools
Exception Value: type object 'School' has no attribute 'field_names'
Request information:
USER: AnonymousUser

GET:
q = 'Nanyang'

POST: No POST data

FILES: No FILES data

COOKIES: No cookie data

META:
CDPATH = '.:/Users/tung:/Users/tung/Projects'
CLICOLOR = '1'
COLORFGBG = '15;0'
COLORTERM = 'truecolor'
COMMAND_MODE = 'unix2003'
CONTENT_LENGTH = ''
CONTENT_TYPE = 'text/plain'
DJANGO_SETTINGS_MODULE = 'singapore_schools.settings'
GATEWAY_INTERFACE = 'CGI/1.1'
HISTFILE = '/Users/tung/.zsh_history'
HISTSIZE = '2000'
HOME = '/Users/tung'
HTTP_ACCEPT = '*/*'
HTTP_HOST = 'localhost:8000'
HTTP_USER_AGENT = 'curl/7.66.0'
ITERM_PROFILE = 'Default'
ITERM_SESSION_ID = 'w1t5p0:D543745C-DBE4-40CA-A88E-2B858C98F3DC'
LANG = 'en_US.UTF-8'
LC_CTYPE = 'UTF-8'
LC_TERMINAL = 'iTerm2'
LC_TERMINAL_VERSION = '3.3.6'
LOCAL = '/Users/tung/.local'
LOGNAME = 'tung'
LaunchInstanceID = '3733B31A-8A21-4F7A-B63C-5FE185400678'
OLDPWD = '/Users/tung/Projects/insight/platform-server/outsight'
PATH = '/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7/bin:/Users/tung/.cargo/bin:/bin:/Users/tung/.pyenv/bin:/Users/tung/Applications/Emacs.app/Contents/MacOS/bin-x86_64-10_10:/Users/tung/Applications/Emacs.app/Contents/MacOS/bin:/Users/tung/.local/sbin:/Users/tung/.local/bin:/Users/tung/Projects/dotfiles/bin:/usr/local/bin:/opt/pkg/sbin:/opt/pkg/bin:/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/Library/Apple/usr/bin:/Library/Apple/bin:/usr/local/MacGPG2/bin:/opt/pkg/sbin:/opt/pkg/bin'
PATH_INFO = '/api/v1/schools'
PGHOST = '127.0.0.1'
PGPASS = 'postgres'
PGPASSWORD = 'postgres'
PGUSER = 'postgres'
PWD = '/Users/tung/Projects/insight/schools-in-singapore'
PYENV_ROOT = '/Users/tung/.pyenv'
QUERY_STRING = 'q=Nanyang'
REMOTE_ADDR = '127.0.0.1'
REMOTE_HOST = ''
REQUEST_METHOD = 'GET'
RUN_MAIN = 'true'
SAVEHIST = '1000'
SCRIPT_NAME = ''
SECURITYSESSIONID = '186a6'
SERVER_NAME = '1.0.0.127.in-addr.arpa'
SERVER_PORT = '8000'
SERVER_PROTOCOL = 'HTTP/1.1'
SERVER_SOFTWARE = 'WSGIServer/0.2'
SHELL = '/bin/zsh'
SHLVL = '1'
SSH_AUTH_SOCK = '/private/tmp/com.apple.launchd.ICO4hZcCIv/Listeners'
TERM = 'xterm-256color'
TERM_PROGRAM = 'iTerm.app'
TERM_PROGRAM_VERSION = '3.3.6'
TERM_SESSION_ID = 'w1t5p0:D543745C-DBE4-40CA-A88E-2B858C98F3DC'
TMPDIR = '/var/folders/sn/j_hy0nm57cl7g45843gm7src0000gn/T/'
TZ = 'UTC'
USER = 'tung'
VIRTUAL_ENV = '/Users/tung/Library/Caches/pypoetry/virtualenvs/schools-in-singapore-6eHyMLPa-py3.7'
WORDCHARS = '*?[]~&;!$%^<>'
XPC_FLAGS = '0x0'
XPC_SERVICE_NAME = '0'
_ = '/Users/tung/.local/bin/poetry'
__CF_USER_TEXT_ENCODING = '0x1F5:0x0:0x0'
wsgi.errors = <_io.TextIOWrapper name='<stderr>' mode='w' encoding='UTF-8'>
wsgi.file_wrapper = ''
wsgi.input = <django.core.handlers.wsgi.LimitedStream object at 0x7fb0d056ec30>
wsgi.multiprocess = False
wsgi.multithread = True
wsgi.run_once = False
wsgi.url_scheme = 'http'
wsgi.version = '(1, 0)'

Settings:
Using settings module singapore_schools.settings
ABSOLUTE_URL_OVERRIDES = {}
ADMINS = [('Tung Dao', 'me@tungdao.com')]
ALLOWED_HOSTS = []
APPEND_SLASH = True
AUTHENTICATION_BACKENDS = ['django.contrib.auth.backends.ModelBackend']
AUTH_PASSWORD_VALIDATORS = '********************'
AUTH_USER_MODEL = 'auth.User'
BASE_DIR = '/Users/tung/Projects/insight/schools-in-singapore'
CACHES = {'default': {'BACKEND': 'django.core.cache.backends.locmem.LocMemCache'}, 'field_keywords': '********************'}
CACHE_MIDDLEWARE_ALIAS = 'default'
CACHE_MIDDLEWARE_KEY_PREFIX = '********************'
CACHE_MIDDLEWARE_SECONDS = 600
CSRF_COOKIE_AGE = 31449600
CSRF_COOKIE_DOMAIN = None
CSRF_COOKIE_HTTPONLY = False
CSRF_COOKIE_NAME = 'csrftoken'
CSRF_COOKIE_PATH = '/'
CSRF_COOKIE_SAMESITE = 'Lax'
CSRF_COOKIE_SECURE = False
CSRF_FAILURE_VIEW = 'django.views.csrf.csrf_failure'
CSRF_HEADER_NAME = 'HTTP_X_CSRFTOKEN'
CSRF_TRUSTED_ORIGINS = []
CSRF_USE_SESSIONS = False
DATABASES = {'default': {'ENGINE': 'django.db.backends.postgresql_psycopg2', 'NAME': 'postgres', 'USER': 'postgres', 'PASSWORD': '********************', 'HOST': 'localhost', 'PORT': 5432, 'ATOMIC_REQUESTS': False, 'AUTOCOMMIT': True, 'CONN_MAX_AGE': 0, 'OPTIONS': {}, 'TIME_ZONE': None, 'TEST': {'CHARSET': None, 'COLLATION': None, 'NAME': None, 'MIRROR': None}}}
DATABASE_ROUTERS = []
DATA_UPLOAD_MAX_MEMORY_SIZE = 2621440
DATA_UPLOAD_MAX_NUMBER_FIELDS = 1000
DATETIME_FORMAT = 'N j, Y, P'
DATETIME_INPUT_FORMATS = ['%Y-%m-%d %H:%M:%S', '%Y-%m-%d %H:%M:%S.%f', '%Y-%m-%d %H:%M', '%Y-%m-%d', '%m/%d/%Y %H:%M:%S', '%m/%d/%Y %H:%M:%S.%f', '%m/%d/%Y %H:%M', '%m/%d/%Y', '%m/%d/%y %H:%M:%S', '%m/%d/%y %H:%M:%S.%f', '%m/%d/%y %H:%M', '%m/%d/%y']
DATE_FORMAT = 'N j, Y'
DATE_INPUT_FORMATS = ['%Y-%m-%d', '%m/%d/%Y', '%m/%d/%y', '%b %d %Y', '%b %d, %Y', '%d %b %Y', '%d %b, %Y', '%B %d %Y', '%B %d, %Y', '%d %B %Y', '%d %B, %Y']
DEBUG = True
DEBUG_PROPAGATE_EXCEPTIONS = False
DECIMAL_SEPARATOR = '.'
DEFAULT_CHARSET = 'utf-8'
DEFAULT_CONTENT_TYPE = 'text/html'
DEFAULT_EXCEPTION_REPORTER_FILTER = 'django.views.debug.SafeExceptionReporterFilter'
DEFAULT_FILE_STORAGE = 'django.core.files.storage.FileSystemStorage'
DEFAULT_FROM_EMAIL = 'webmaster@localhost'
DEFAULT_INDEX_TABLESPACE = ''
DEFAULT_TABLESPACE = ''
DISALLOWED_USER_AGENTS = []
ELASTICSEARCH_DSL = {'default': {'hosts': 'localhost:9200'}}
EMAIL_BACKEND = 'django.core.mail.backends.smtp.EmailBackend'
EMAIL_HOST = 'localhost'
EMAIL_HOST_PASSWORD = '********************'
EMAIL_HOST_USER = ''
EMAIL_PORT = 25
EMAIL_SSL_CERTFILE = None
EMAIL_SSL_KEYFILE = '********************'
EMAIL_SUBJECT_PREFIX = '[Django] '
EMAIL_TIMEOUT = None
EMAIL_USE_LOCALTIME = False
EMAIL_USE_SSL = False
EMAIL_USE_TLS = False
FILE_CHARSET = 'utf-8'
FILE_UPLOAD_DIRECTORY_PERMISSIONS = None
FILE_UPLOAD_HANDLERS = ['django.core.files.uploadhandler.MemoryFileUploadHandler', 'django.core.files.uploadhandler.TemporaryFileUploadHandler']
FILE_UPLOAD_MAX_MEMORY_SIZE = 2621440
FILE_UPLOAD_PERMISSIONS = None
FILE_UPLOAD_TEMP_DIR = None
FIRST_DAY_OF_WEEK = 0
FIXTURE_DIRS = []
FORCE_SCRIPT_NAME = None
FORMAT_MODULE_PATH = None
FORM_RENDERER = 'django.forms.renderers.DjangoTemplates'
IGNORABLE_404_URLS = []
INSTALLED_APPS = ['django.contrib.admin', 'django.contrib.auth', 'django.contrib.contenttypes', 'django.contrib.sessions', 'django.contrib.messages', 'django.contrib.staticfiles', 'django_elasticsearch_dsl', 'schools']
INTERNAL_IPS = []
LANGUAGES = [('af', 'Afrikaans'), ('ar', 'Arabic'), ('ast', 'Asturian'), ('az', 'Azerbaijani'), ('bg', 'Bulgarian'), ('be', 'Belarusian'), ('bn', 'Bengali'), ('br', 'Breton'), ('bs', 'Bosnian'), ('ca', 'Catalan'), ('cs', 'Czech'), ('cy', 'Welsh'), ('da', 'Danish'), ('de', 'German'), ('dsb', 'Lower Sorbian'), ('el', 'Greek'), ('en', 'English'), ('en-au', 'Australian English'), ('en-gb', 'British English'), ('eo', 'Esperanto'), ('es', 'Spanish'), ('es-ar', 'Argentinian Spanish'), ('es-co', 'Colombian Spanish'), ('es-mx', 'Mexican Spanish'), ('es-ni', 'Nicaraguan Spanish'), ('es-ve', 'Venezuelan Spanish'), ('et', 'Estonian'), ('eu', 'Basque'), ('fa', 'Persian'), ('fi', 'Finnish'), ('fr', 'French'), ('fy', 'Frisian'), ('ga', 'Irish'), ('gd', 'Scottish Gaelic'), ('gl', 'Galician'), ('he', 'Hebrew'), ('hi', 'Hindi'), ('hr', 'Croatian'), ('hsb', 'Upper Sorbian'), ('hu', 'Hungarian'), ('hy', 'Armenian'), ('ia', 'Interlingua'), ('id', 'Indonesian'), ('io', 'Ido'), ('is', 'Icelandic'), ('it', 'Italian'), ('ja', 'Japanese'), ('ka', 'Georgian'), ('kab', 'Kabyle'), ('kk', 'Kazakh'), ('km', 'Khmer'), ('kn', 'Kannada'), ('ko', 'Korean'), ('lb', 'Luxembourgish'), ('lt', 'Lithuanian'), ('lv', 'Latvian'), ('mk', 'Macedonian'), ('ml', 'Malayalam'), ('mn', 'Mongolian'), ('mr', 'Marathi'), ('my', 'Burmese'), ('nb', 'Norwegian Bokmål'), ('ne', 'Nepali'), ('nl', 'Dutch'), ('nn', 'Norwegian Nynorsk'), ('os', 'Ossetic'), ('pa', 'Punjabi'), ('pl', 'Polish'), ('pt', 'Portuguese'), ('pt-br', 'Brazilian Portuguese'), ('ro', 'Romanian'), ('ru', 'Russian'), ('sk', 'Slovak'), ('sl', 'Slovenian'), ('sq', 'Albanian'), ('sr', 'Serbian'), ('sr-latn', 'Serbian Latin'), ('sv', 'Swedish'), ('sw', 'Swahili'), ('ta', 'Tamil'), ('te', 'Telugu'), ('th', 'Thai'), ('tr', 'Turkish'), ('tt', 'Tatar'), ('udm', 'Udmurt'), ('uk', 'Ukrainian'), ('ur', 'Urdu'), ('vi', 'Vietnamese'), ('zh-hans', 'Simplified Chinese'), ('zh-hant', 'Traditional Chinese')]
LANGUAGES_BIDI = ['he', 'ar', 'fa', 'ur']
LANGUAGE_CODE = 'en-us'
LANGUAGE_COOKIE_AGE = None
LANGUAGE_COOKIE_DOMAIN = None
LANGUAGE_COOKIE_NAME = 'django_language'
LANGUAGE_COOKIE_PATH = '/'
LOCALE_PATHS = []
LOGGING = {}
LOGGING_CONFIG = 'logging.config.dictConfig'
LOGIN_REDIRECT_URL = '/accounts/profile/'
LOGIN_URL = '/accounts/login/'
LOGOUT_REDIRECT_URL = None
MANAGERS = []
MEDIA_ROOT = ''
MEDIA_URL = ''
MESSAGE_STORAGE = 'django.contrib.messages.storage.fallback.FallbackStorage'
MIDDLEWARE = ['django.middleware.security.SecurityMiddleware', 'django.contrib.sessions.middleware.SessionMiddleware', 'django.middleware.common.CommonMiddleware', 'django.middleware.csrf.CsrfViewMiddleware', 'django.contrib.auth.middleware.AuthenticationMiddleware', 'django.contrib.messages.middleware.MessageMiddleware', 'django.middleware.clickjacking.XFrameOptionsMiddleware']
MIGRATION_MODULES = {}
MONTH_DAY_FORMAT = 'F j'
NUMBER_GROUPING = 0
PASSWORD_HASHERS = '********************'
PASSWORD_RESET_TIMEOUT_DAYS = '********************'
PREPEND_WWW = False
REST_FRAMEWORK = {'DEFAULT_PAGINATION_CLASS': 'rest_framework.pagination.LimitOffsetPagination', 'PAGE_SIZE': 20}
ROOT_URLCONF = 'singapore_schools.urls'
SECRET_KEY = '********************'
SECURE_BROWSER_XSS_FILTER = False
SECURE_CONTENT_TYPE_NOSNIFF = False
SECURE_HSTS_INCLUDE_SUBDOMAINS = False
SECURE_HSTS_PRELOAD = False
SECURE_HSTS_SECONDS = 0
SECURE_PROXY_SSL_HEADER = None
SECURE_REDIRECT_EXEMPT = []
SECURE_SSL_HOST = None
SECURE_SSL_REDIRECT = False
SERVER_EMAIL = 'noreply@schools.gov.sg'
SESSION_CACHE_ALIAS = 'default'
SESSION_COOKIE_AGE = 1209600
SESSION_COOKIE_DOMAIN = None
SESSION_COOKIE_HTTPONLY = True
SESSION_COOKIE_NAME = 'sessionid'
SESSION_COOKIE_PATH = '/'
SESSION_COOKIE_SAMESITE = 'Lax'
SESSION_COOKIE_SECURE = False
SESSION_ENGINE = 'django.contrib.sessions.backends.db'
SESSION_EXPIRE_AT_BROWSER_CLOSE = False
SESSION_FILE_PATH = None
SESSION_SAVE_EVERY_REQUEST = False
SESSION_SERIALIZER = 'django.contrib.sessions.serializers.JSONSerializer'
SETTINGS_MODULE = 'singapore_schools.settings'
SHORT_DATETIME_FORMAT = 'm/d/Y P'
SHORT_DATE_FORMAT = 'm/d/Y'
SIGNING_BACKEND = 'django.core.signing.TimestampSigner'
SILENCED_SYSTEM_CHECKS = []
STATICFILES_DIRS = ['/Users/tung/Projects/insight/schools-in-singapore/public']
STATICFILES_FINDERS = ['django.contrib.staticfiles.finders.FileSystemFinder', 'django.contrib.staticfiles.finders.AppDirectoriesFinder']
STATICFILES_STORAGE = 'django.contrib.staticfiles.storage.StaticFilesStorage'
STATIC_ROOT = '/Users/tung/Projects/insight/schools-in-singapore/static'
STATIC_URL = '/static/'
TEMPLATES = [{'BACKEND': 'django.template.backends.django.DjangoTemplates', 'DIRS': ['/Users/tung/Projects/insight/schools-in-singapore/templates'], 'APP_DIRS': True, 'OPTIONS': {'context_processors': ['django.template.context_processors.debug', 'django.template.context_processors.request', 'django.contrib.auth.context_processors.auth', 'django.contrib.messages.context_processors.messages']}}]
TEST_NON_SERIALIZED_APPS = []
TEST_RUNNER = 'django.test.runner.DiscoverRunner'
THOUSAND_SEPARATOR = ','
TIME_FORMAT = 'P'
TIME_INPUT_FORMATS = ['%H:%M:%S', '%H:%M:%S.%f', '%H:%M']
TIME_ZONE = 'UTC'
USE_I18N = True
USE_L10N = True
USE_THOUSAND_SEPARATOR = False
USE_TZ = True
USE_X_FORWARDED_HOST = False
USE_X_FORWARDED_PORT = False
WSGI_APPLICATION = 'singapore_schools.wsgi.application'
X_FRAME_OPTIONS = 'SAMEORIGIN'
YEAR_MONTH_FORMAT = 'F Y'


You're seeing this error because you have DEBUG = True in your
Django settings file. Change that to False, and Django will
display a standard page generated by the handler for this status code.

#+end_example

* TODO

- Properly handle keyword filters
- Dockerfile to build deployment image
